#+title: GNU Emacs
#+description: This is my Emacs Configuration
*** Language-specific tweaks

#+begin_src emacs-lisp
;; Language-Specific Tweaks
(setq-default python-indent-offset custom-tab-width) ;; Python
(setq-default python-indent-guess-indent-offset nil) ;; Python
(setq-default js-indent-level custom-tab-width)      ;; Javascript
(setq-default c-basic-offset 4)                      ;; C/C++/Java
(setq LaTeX-item-indent 0)                           ;; LaTeX
(setq LaTeX-indent-level 4)                          ;; LaTeX
(add-hook 'html-mode-hook                            ;; html
    (lambda ()
    ;; Default indentation is usually 2 spaces, changing to 4.
        (set (make-local-variable 'sgml-basic-offset) 4)))
(add-hook 'sgml-mode-hook                            ;; html
    (lambda ()
        ;; Default indentation to 2, but let SGML mode guess, too.
        (set (make-local-variable 'sgml-basic-offset) 2)
        (sgml-guess-indent)))

#+end_src

#+RESULTS:
| lambda | nil | (set (make-local-variable 'sgml-basic-offset) 2) | (sgml-guess-indent) |

** Fonts

#+begin_src emacs-lisp
(set-face-attribute 'default nil
    :font "JetBrains  Mono Medium")
(set-face-attribute 'variable-pitch nil
	:font "JetBrains Mono Medium")
(set-face-attribute 'fixed-pitch nil
    :font "JetBrains Mono Medium")

(setq-default line-spacing 0.10)
(add-to-list 'default-frame-alist '(font . "JetBrains Mono Medium"))
;; (add-to-list 'default-frame-alist '(line-spacing . 0.2))
#+end_src

#+RESULTS:
: ((font . JetBrains Mono SemiBold 13) (font . JetBrains Mono 13) (vertical-scroll-bars))

** Transparency

#+begin_src emacs-lisp
(set-frame-parameter nil 'alpha-background 70) ; For current frame
(add-to-list 'default-frame-alist '(alpha-background . 70)) ; For all new frames henceforth
#+end_src

#+RESULTS:
: ((alpha-background . 100) (alpha-background . 80) (font . JetBrains Mono Medium) (vertical-scroll-bars))

*** Shell prompt fix
#+begin_src emacs-lisp
(setq shell-prompt-pattern '"^[^#$%>\n]*~?[#$%>] *")
#+end_src

#+RESULTS:
: ^[^#$%>
: ]*~?[#$%>] *

*** Fix Indentation

#+begin_src emacs-lisp
  (add-hook 'dockerfile-mode-hook
        (lambda ()
            (setq-local indent-line-function #'sh-indent-line)))
#+end_src

#+RESULTS:
| lambda | nil | (setq-local indent-line-function #'sh-indent-line)                 |
| lambda | nil | (set (make-local-variable 'indent-line-function) #'sh-indent-line) |

** Highlight Indent
#+begin_src emacs-lisp
;; (use-package highlight-indent-guides)
;; (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
;; (setq highlight-indent-guides-method 'character)
;; (setq highlight-indent-guides-responsive 'nil)
;; (setq highlight-indent-guides-auto-enabled nil)

;; (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
;; (set-face-foreground 'highlight-indent-guides-stack-character-face "gainsboro")
;; (set-face-foreground 'highlight-indent-guides-top-character-face "white")

;; (setq highlight-indent-guides-auto-character-face-perc 50)
;; (setq highlight-indent-guides-auto-stack-character-face-perc 80)
;; (setq highlight-indent-guides-auto-top-character-face-perc 100)
#+end_src

#+RESULTS:
| highlight-indent-guides-mode | rainbow-delimiters-mode | disable-tabs |

